In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('summer.csv')

In [3]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [4]:
df.tail()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [5]:
df.shape

(31165, 9)

In [6]:
df.columns

Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete', 'Country', 'Gender',
       'Event', 'Medal'],
      dtype='object')

In [7]:
pd.value_counts(df['Gender'])

Men      22746
Women     8419
Name: Gender, dtype: int64

In [8]:
pd.value_counts(df['Sport']).head()

Aquatics      4170
Athletics     3638
Rowing        2667
Gymnastics    2307
Fencing       1613
Name: Sport, dtype: int64

In [9]:
# find out the male athelete with highest number of medals...
# find out the female athelete with highest number of medals...

In [10]:
df.groupby('Gender')['Athlete'].value_counts()

Gender  Athlete
Men     PHELPS, Michael         22
        ANDRIANOV, Nikolay      15
        MANGIAROTTI, Edoardo    13
        ONO, Takashi            13
        SHAKHLIN, Boris         13
                                ..
Women   ZURRER, Emily Jane       1
        ZVEREVA, Natalya         1
        ZVONAREVA, Vera          1
        ZWEHL, Julia             1
        ZWIERS, Claudia          1
Name: Athlete, Length: 22767, dtype: int64

In [11]:
men_data = df[df['Gender'] == 'Men']
women_data = df[df['Gender'] == 'Women']

In [12]:
men_data.shape

(22746, 9)

In [13]:
women_data.shape

(8419, 9)

In [14]:
pd.value_counts(men_data['Athlete']).head(1)

PHELPS, Michael    22
Name: Athlete, dtype: int64

In [15]:
pd.value_counts(women_data['Athlete']).head(1)

LATYNINA, Larisa    18
Name: Athlete, dtype: int64

In [16]:
df['Athlete'].str.split(", ").head()

0         [HAJOS, Alfred]
1      [HERSCHMANN, Otto]
2     [DRIVAS, Dimitrios]
3    [MALOKINIS, Ioannis]
4    [CHASAPIS, Spiridon]
Name: Athlete, dtype: object

In [17]:
df['Athlete'].str.split(", ").str[::-1].head()

0         [Alfred, HAJOS]
1      [Otto, HERSCHMANN]
2     [Dimitrios, DRIVAS]
3    [Ioannis, MALOKINIS]
4    [Spiridon, CHASAPIS]
Name: Athlete, dtype: object

In [18]:
df['Athlete'] = df['Athlete'].str.split(", ").str[::-1].str.join(" ").str.title()

In [19]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,Alfred Hajos,HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,Otto Herschmann,AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,Dimitrios Drivas,GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,Ioannis Malokinis,GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,Spiridon Chasapis,GRE,Men,100M Freestyle For Sailors,Silver

In [20]:
men_data.groupby('Athlete')['Medal'].count()

Athlete
AABYE, Edgar                 1
AALTONEN, Arvo Ossian        2
AALTONEN, Paavo Johannes     5
AANING, Alf Lied             1
AARDEWIJN, Pepijn            1
                            ..
ÖSTERVOLD, Jan Olsen         1
ÖSTERVOLD, Kristian Olsen    1
ÖSTERVOLD, Ole Olsen         1
ÖSTMO, Ole                   4
ÖSTRAND, Per-Olof            1
Name: Medal, Length: 16929, dtype: int64

In [21]:
men_data.groupby('Athlete')['Medal'].count().reset_index().head()

                    Athlete  Medal
0              AABYE, Edgar      1
1     AALTONEN, Arvo Ossian      2
2  AALTONEN, Paavo Johannes      5
3          AANING, Alf Lied      1
4         AARDEWIJN, Pepijn      1

In [22]:
men_data.groupby(['Athlete','Medal'])['Sport'].count().reset_index().head()

                    Athlete   Medal  Sport
0              AABYE, Edgar    Gold      1
1     AALTONEN, Arvo Ossian  Bronze      2
2  AALTONEN, Paavo Johannes  Bronze      2
3  AALTONEN, Paavo Johannes    Gold      3
4          AANING, Alf Lied  Silver      1

In [23]:
men_data.groupby(['Athlete','Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending = False).head()

               Athlete Medal  Sport
13732  PHELPS, Michael  Gold     18
16497      SPITZ, Mark  Gold      9
12769     NURMI, Paavo  Gold      9
10107      LEWIS, Carl  Gold      9
4838         EWRY, Ray  Gold      8

In [24]:
df_2 = men_data.groupby(['Athlete','Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending = False)

In [25]:
df_2.drop_duplicates('Medal')

                Athlete   Medal  Sport
13732   PHELPS, Michael    Gold     18
18556  VORONIN, Mikhail  Silver      6
12428     NEMOV, Alexei  Bronze      6

In [26]:
df_2.drop_duplicates('Medal', keep='last')

                        Athlete   Medal  Sport
6953        HELLSTEN, Nils Erik    Gold      1
6948   HELLICKSON, Russell Owen  Silver      1
19738         ÖSTRAND, Per-Olof  Bronze      1

In [28]:
# print medals by year of India...
Ind=df[df['Country']=='IND']
Ind.groupby(['Year'])['Medal'].count()

Year
1900     2
1928    15
1932    11
1936    19
1948    20
1952    15
1956    17
1960    13
1964    15
1968    15
1972    14
1980    16
1996     1
2000     1
2004     1
2008     3
2012     6
Name: Medal, dtype: int64

In [32]:
# country | gold | silver | bronze
df.groupby('Country')['Medal'].count().sort_values(ascending=False).reset_index().head()

  Country  Medal
0     USA   4585
1     URS   2049
2     GBR   1720
3     FRA   1396
4     GER   1305

In [35]:
df.groupby(['Country','Medal'])['Sport'].count().sort_values(ascending=False).reset_index().head()

  Country   Medal  Sport
0     USA    Gold   2235
1     USA  Silver   1252
2     USA  Bronze   1098
3     URS    Gold    838
4     URS  Silver    627

In [40]:
countries = df.groupby(['Country','Medal'])['Sport'].count().sort_values(ascending=False).reset_index()

In [41]:
countries = countries.pivot('Country','Medal','Sport').fillna(0)

In [42]:
countries.head()

Medal    Bronze  Gold  Silver
Country
AFG         2.0   0.0     0.0
AHO         0.0   0.0     1.0
ALG         8.0   5.0     2.0
ANZ         5.0  20.0     4.0
ARG        91.0  69.0    99.0

In [44]:
countries.sort_values(by='Gold', ascending=False).head()

Medal    Bronze    Gold  Silver
Country
USA      1098.0  2235.0  1252.0
URS       584.0   838.0   627.0
GBR       553.0   546.0   621.0
ITA       404.0   476.0   416.0
GER       475.0   452.0   378.0

In [46]:
countries.dtypes

Medal
Bronze    float64
Gold      float64
Silver    float64
dtype: object

In [48]:
countries.astype('int64').head()

Medal    Bronze  Gold  Silver
Country
AFG           2     0       0
AHO           0     0       1
ALG           8     5       2
ANZ           5    20       4
ARG          91    69      99